import re

# Проверка соответствия кода телефона стране
# Ищем упоминания кода телефона, сравниваем с количеством форм на странице
def phone_code(self):
    phone_codes = { 'mk':('389'), 'sq':('389'), 'cs':('420'),'et':('372'),
                    'zh':('852', '886'), 'sw':('255', '254', '256'),
                    'ar':('966', '965', '973', '971', '968', '221', '212'),
                    'uk':('380'), 'sl':('386'), 'de':('43', '49', '32', '41'),
                    'fl':('63'), 'tl':('63'), 'pl':('48'), 'id':('62'), 'ko':('850', '82'),
                    'es':('591', '593', '51', '54', '34', '52', '57'),
                    'th':('66'), 'ru':('7'), 'hi':('91'), 'it':('39', '41'),
                    'sk':('421'), 'hu':('36'), 'nl':('32', '31'), 'ms':('60'),
                    'fi':('358'),'sv':('358'),'vi':('84'),'bs':('387'),
                    'sr':('387', '381'),'hr':('387', '385'), 'bg':('359'),
                    'fr':('32', '41', '33', '221'), 'pt':('55', '351'),
                    'ro':('40'), 'si':('94'),'ta':('94'),'lv':('371'),
                    'lt':('370'), 'el':('30')}
    if self.lang != 'en':
        source = self.source
        matches = 0
        for code in phone_codes[self.lang]:
            matches += len(re.findall(r'\+[\s]?' + code, source))

        if matches >= self.form_num:
            self.log('во всех формах есть телефон с подходящим кодом')
        else:
            self.logBad('не во всех формах есть телефон с подходящим кодом (%s тел / %s форм), %s' % (matches, self.form_num, phone_codes[self.lang]))
    else:
        self.logBad('необходимо проверить код телефона в подсказке')